############ Actividades Ordenadas segun su tiempo de inicio ##########

 Number of Activities: 32
|   1  |  0.00   |  0.000   |                  |   [0, 0, 0, 0]    |  False  |  False  |  False  |  0.00   |

|   2  |  0.00   |  3.875   |             1,   |   [0, 0, 1, 0]    |  False  |  False  |  False  |  3.88   |

|   3  |  0.00   |  21.974  |             1,   |   [8, 0, 0, 0]    |  False  |  False  |  False  |  21.97  |

|   4  |  0.00   |  6.479   |             1,   |   [0, 0, 0, 9]    |  False  |  False  |  False  |  6.48   |

|   5  |  21.97  |  8.281   |             4,   |   [0, 6, 0, 0]    |  False  |  False  |  False  |  30.26  |

|   8  |  21.97  |  5.675   |             2,   |   [0, 0, 0, 7]    |  False  |  False  |  False  |  27.65  |

|  13  |  21.97  |  8.187   |             4,   |   [4, 0, 0, 0]    |  False  |  False  |  False  |  30.16  |

|   6  |  30.26  |  4.789   |          2, 5,   |   [0, 0, 0, 9]    |  False  |  False  |  False  |  35.04  |

|   7  |  30.26  |  1.169   |             5,   |   [3, 0, 0, 0]    |  False  |  False  |  False  |  31.42  |

|   9  |  30.26  |  17.759  |          4, 8,   |   [0, 5, 0, 0]    |  False  |  False  |  False  |  48.01  |

|  14  |  30.26  |  11.324  |            13,   |   [0, 4, 0, 0]    |  False  |  False  |  False  |  41.58  |

|  15  |  30.26  |  0.868   |             8,   |   [5, 0, 0, 0]    |  False  |  False  |  False  |  31.12  |

|  20  |  30.26  |  11.471  |            13,   |   [0, 2, 0, 0]    |  False  |  False  |  False  |  41.73  |

|  23  |  30.26  |  19.720  |             5,   |   [0, 0, 0, 1]    |  False  |  False  |  False  |  49.98  |

|  10  |  49.98  |  3.935   |             9,   |   [0, 0, 0, 1]    |  False  |  False  |  False  |  53.91  |

|  11  |  49.98  |  12.259  |             7,   |   [0, 0, 5, 0]    |  False  |  False  |  False  |  62.23  |

|  16  |  49.98  |  4.890   |          6, 7,   |   [0, 0, 0, 3]    |  False  |  False  |  False  |  54.87  |

|  21  |  49.98  |  2.776   |         8, 20,   |   [0, 10, 0, 0]   |  False  |  False  |  False  |  52.75  |

|  25  |  49.98  |  13.401  |         2, 23,   |   [0, 0, 0, 7]    |  False  |  False  |  False  |  63.38  |

|  12  |  63.38  |  3.793   |            11,   |   [6, 0, 0, 0]    |  False  |  False  |  False  |  67.17  |

|  17  |  63.38  |  2.161   |     6, 10, 14,   |   [3, 0, 0, 0]    |  False  |  False  |  False  |  65.54  |

|  22  |  63.38  |  5.015   |     6, 10, 21,   |   [0, 7, 0, 0]    |  False  |  False  |  False  |  68.39  |

|  24  |  63.38  |  8.857   |     9, 21, 23,   |   [0, 0, 1, 0]    |  False  |  False  |  False  |  72.23  |

|  26  |  63.38  |  2.221   |    13, 16, 25,   |   [0, 0, 0, 4]    |  False  |  False  |  False  |  65.60  |

|  18  |  72.23  |  8.121   |        16, 17,   |   [0, 3, 0, 0]    |  False  |  False  |  False  |  80.35  |

|  19  |  72.23  |  5.018   |        10, 12,   |   [0, 9, 0, 0]    |  False  |  False  |  False  |  77.25  |

|  27  |  72.23  |  12.820  |    12, 17, 26,   |   [0, 3, 0, 0]    |  False  |  False  |  False  |  85.05  |

|  28  |  72.23  |  4.035   |     7, 24, 25,   |   [0, 0, 9, 0]    |  False  |  False  |  False  |  76.27  |

|  31  |  72.23  |  24.182  |     3, 17, 22,   |   [0, 0, 2, 0]    |  False  |  False  |  False  |  96.42  |

|  29  |  96.42  |  1.847   |    14, 15, 28,   |   [9, 0, 0, 0]    |  False  |  False  |  False  |  98.26  |

|  30  |  96.42  |  0.948   |    18, 19, 27,   |   [0, 0, 3, 0]    |  False  |  False  |  False  |  97.36  |

|  32  |  98.26  |  0.000   |    29, 30, 31,   |   [0, 0, 0, 0]    |  False  |  False  |  False  |  98.26  |



 

Inserte el número de escenarios: 10000
Robustez 1: 539.2837603090527 
Robustez 2: 23.921820025446802 
Valor Esperado: 74.93682182636464
>>> 